cases/05_navier_stokes_equation/20_triangular_cavity_projection_Re100_hybrid160/N12/constant/Ccx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
238
(
-1.14606362735
-0.608085222876
-0.268989202239
0.268989202232
0.60808522287
1.14606362734
-1.48515964798
1.48515964798
...
)
;

boundaryField
{
    movingTop
    {
        type            calculated;
        value           nonuniform List<scalar> 8(-1.08253175473 -0.649519052841 -0.21650635095 0.216506350942 0.649519052836 1.08253175473 -1.51554445662 1.51554445662);
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 8(1.40729128115 1.19078493021 0.97427857926 0.757772228314 0.541265877367 0.32475952642 1.6237976321 0.108253175473);
    }
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 8(-0.324759526418 -0.541265877364 -0.757772228309 -0.974278579255 -1.1907849302 -1.40729128115 -1.6237976321 -0.108253175473);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
