cases/05_navier_stokes_equation/20_triangular_cavity_projection_Re100_hybrid160/N12/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    movingTop
    {
        type            patch;
        physicalType    patch;
        nFaces          8;
        startFace       357;
    }
    rightWall
    {
        type            patch;
        physicalType    patch;
        nFaces          8;
        startFace       365;
    }
    leftWall
    {
        type            patch;
        physicalType    patch;
        nFaces          8;
        startFace       373;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          238;
        startFace       381;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          238;
        startFace       619;
    }
)

// ************************************************************************* //
